In [1]:
#Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:
#Check the number of rentals for each customer for May
#Check the number of rentals for each customer for June
#Hint: You can store the results from the two queries in two separate dataframes.

In [2]:
from sqlalchemy import create_engine
import pymysql

import pandas as pd
import getpass

password=getpass.getpass()

connection_string="mysql+pymysql://root:"+password+"@localhost/bank"
engine=create_engine(connection_string)

········

In [6]:
import mysql.connector
cnx=mysql.connector.connect(user="root",password=password,host="127.0.0.1")
cnx = mysql.connector.connect(user = 'root',password = password, host = '127.0.0.1')
cnx.is_connected()

True

In [7]:
cursor = cnx.cursor()
cursor.execute("select * from sakila.rentals_may")
result = pd.DataFrame(cursor.fetchall())
result.columns = [head[0] for head in cursor.description]
result.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [29]:
cursor.execute("select count(*) as rentals, customer_id from sakila.rentals_may group by customer_id order by rentals desc")
result_may = pd.DataFrame(cursor.fetchall())
result_may.columns = [head[0] for head in cursor.description]
result_may.head()

   rentals  customer_id
0        8          197
1        7          109
2        7          506
3        6           19
4        6           53

In [36]:
cursor2 = cnx.cursor()
cursor.execute("select * from sakila.rentals_june")
result = pd.DataFrame(cursor.fetchall())
result.columns = [head[0] for head in cursor.description]
result.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [38]:
cursor.execute("select count(*) as rentals, customer_id from sakila.rentals_june group by customer_id order by rentals desc")
result_june = pd.DataFrame(cursor2.fetchall())
result_june.columns = [head[0] for head in cursor.description]
result_june.head()

   rentals  customer_id
0       11           31
1       10          454
2        9          213
3        9          267
4        9          295

In [39]:
#Write a function that checks if customer borrowed more or less films in the month of June as compared to May.
#Hint: For this part, you can create a join between the two dataframes created before,
#using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

In [89]:
def customer_rentals():

    query1 = """select count(*) as rentals_may, customer_id from sakila.rentals_may group by customer_id order by rentals_may desc"""
    query2 = """select count(*) as rentals_june, customer_id from sakila.rentals_june group by customer_id order by rentals_june desc"""
    data_query1 = cursor.execute(query1)
    result1 = pd.DataFrame(cursor.fetchall())
    result1.columns = [head[0] for head in cursor.description]
    result1.head()
    
    data_query2 = cursor.execute(query2)
    result2 = pd.DataFrame(cursor.fetchall())
    result2.columns = [head[0] for head in cursor.description]
    result2.head()
    
    merge = result1.merge(result2, on = 'customer_id', how = 'inner')
    
    merge.rename(columns = {'num_rentals_x' : 'rentals_may', 'num_rentals_y' : 'rentals_june'}, inplace = True)
    
    return merge

In [90]:
data=customer_rentals()
data

     rentals_may  customer_id  rentals_june
0              8          197             8
1              7          109             5
2              7          506             5
3              6           19             3
4              6           53             5
..           ...          ...           ...
507            1          580             1
508            1          582             3
509            1          590             5
510            1          595             2
511            1          599             4

[512 rows x 3 columns]

In [91]:
data=data.loc[:,["customer_id","rentals_may","rentals_june"]]
data

     customer_id  rentals_may  rentals_june
0            197            8             8
1            109            7             5
2            506            7             5
3             19            6             3
4             53            6             5
..           ...          ...           ...
507          580            1             1
508          582            1             3
509          590            1             5
510          595            1             2
511          599            1             4

[512 rows x 3 columns]

In [93]:
data["dif"]=data["rentals_june"]-data["rentals_may"]
data

     customer_id  rentals_may  rentals_june  dif
0            197            8             8    0
1            109            7             5   -2
2            506            7             5   -2
3             19            6             3   -3
4             53            6             5   -1
..           ...          ...           ...  ...
507          580            1             1    0
508          582            1             3    2
509          590            1             5    4
510          595            1             2    1
511          599            1             4    3

[512 rows x 4 columns]